banner
bare
beast
breed
bug
carbon
cling
compound
conservation
conserve
dam
designate
destruction
destructive
diminish
disastrous
discard
disposal
dispose
driving
drought
dump
echo
ecological
emission
erupt
exotic
forecast
greenhouse
habitat
harmony
hidden
horizon
horn
large-scale
litter
log
loom
marine
minimize
minute
monster
nest
pond
precede
precedent
predator
rat
reproduce
reproduction
rose
shore
strive
summit
surge
sustainable
terrain
tide
toxic
trap
tsunami
variable
variation
varied
vertical
weed
widespread
width
worm
adoption
betray
buddy
buffer
companion
compromise
confront
confrontation
counselling
counsellor
dependence
dependent
dilemma
divorce
embrace
encouragement
encouraging
engagement
gathering
inherit
interfere
interference
lifelong
long-standing
long-time
magical
mate
meaningful
mutual
offspring
originate
passionate
passive
precious
realization
resemble
reside
residence
residential
romance
sake
scattered
separation
sibling
spell
spoil
spouse
supportive
widow
appetite
balanced
barrel
blend
cater
chop
chunk
cocktail
complement
consumption
dairy
dip
drain
eliminate
flavour
grasp
grind
handful
herb
litre
organic
processing
protein
remains
residue
soak
spice
stall
stir
suck
swallow
warming
wheat
whip
abortion
accelerate
acute
addiction
adhere
adverse
AIDS
allowance
ambulance
anxiety
beneficial
beneficiary
bleed
chronic
circulate
circulation
accidentally
collision
crush
debris
drown
evacuate
evident
fragile
fragment
identification
inevitable
inevitably
minimal
motorist
plunge
slam
slap
slash
smash
snap
spill
spin
spine
stumble
tragedy
tragic
wrist
yell
absurd
casual
colourful
crystal
differ
differentiate
distinct
distinction
distinctive
distinguish
elaborate
fabric
fabulous
fade
fake
gaze
golden
gorgeous
grace
identical
magnificent
naked
outfit
patch
ridiculous
robust
sexy
shaped
strand
striking
texture
thread
transformation
twist
apology
articulate
assert
assertion
assurance
assure
breakdown
broadly
clarify
clarity
conceal
concede
congratulate
consult
consultant
consultation
convey
correspond
correspondence
correspondent
counter
cue
enquire
envelope
explicit
explicitly
frankly
gesture
hint
metaphor
obstacle
pause
query
recipient
reminder
scenario
seldom
spam
agricultural
agriculture
backdrop
bay
canal
cattle
cave
cliff
coastal
cultivate
harvest
mill
peasant
spectacular
villager
angel
bishop
bless
blessing
congregation
cult
demon
devil
diverse
diversity
divine
doctrine
firework
heritage
indigenous
legacy
monk
mosque
myth
offering
parish
pastor
preach
preservation
ritual
sacred
sacrifice
saint
secular
sin
symbolic
theology
tribal
tribe
vow
worship
absorb
abstract
academy
accent
accomplish
accomplishment
accumulate
accumulation
acquisition
adaptation
admission
allocate
allocation
analogy
array
cluster
complication
confine
confirmation
consciousness
considerable
considerably
cope
correlate
correlation
countless
crack
damaging
defect
deficiency
deficit
delicate
depression
deprive
deteriorate
diagnose
diagnosis
disability
disabled
discharge
discourage
disorder
donation
donor
dose
elbow
embed
endure
epidemic
excess
excessive
exposure
fatal
fever
fibre
fine
fit
flesh
fluid
forbid
hazard
heal
healthcare
immune
indication
indicator
infect
inhibit
inject
injection
insert
insertion
instruct
intake
intensify
intensity
intensive
isolate
kidney
kit
lap
limb
liver
medication
meditation
miracle
moderate
nursing
nutrition
obesity
partially
physician
pill
pregnancy
preliminary
prescribe
prescription
psychiatric
psychological
pulse
rehabilitation
relieve
remedy
removal
scratch
severely
skull
stroke
supplement
surgeon
surgical
survival
survivor
syndrome
terminal
terminate
testing
therapist
thumb
tissue
tobacco
transmission
transmit
trauma
trigger
undergo
useless
vein
visible
weaken
well-being
workout